In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({
    "city":['mumbai','kolkata','delhi','bangalore'],
    "temp":[32 ,43 ,43 ,21],
    "humidity":[80,90,100,78]
})
india_weather

        city  temp  humidity
0     mumbai    32        80
1    kolkata    43        90
2      delhi    43       100
3  bangalore    21        78

In [6]:
usa_weather = pd.DataFrame({
    "city":['new york','chicago','orlando'],
    "temp":[23,33,13],
    "humidity":[180,50,68]
})
usa_weather

       city  temp  humidity
0  new york    23       180
1   chicago    33        50
2   orlando    13        68

***marge***

In [7]:
df = pd.concat([india_weather,usa_weather])
df

        city  temp  humidity
0     mumbai    32        80
1    kolkata    43        90
2      delhi    43       100
3  bangalore    21        78
0   new york    23       180
1    chicago    33        50
2    orlando    13        68

id problem noticed 0123 and 012

In [8]:
df = pd.concat([india_weather,usa_weather],ignore_index=True)
df

        city  temp  humidity
0     mumbai    32        80
1    kolkata    43        90
2      delhi    43       100
3  bangalore    21        78
4   new york    23       180
5    chicago    33        50
6    orlando    13        68

we can also make this as key , so that we can easily get the data in future

In [13]:
df = pd.concat([india_weather,usa_weather],keys =["india","usa"])
df

              city  temp  humidity
india 0     mumbai    32        80
      1    kolkata    43        90
      2      delhi    43       100
      3  bangalore    21        78
usa   0   new york    23       180
      1    chicago    33        50
      2    orlando    13        68

letter on if i just want inidan cities

In [14]:
df.loc["india"]

        city  temp  humidity
0     mumbai    32        80
1    kolkata    43        90
2      delhi    43       100
3  bangalore    21        78

In [15]:
df.loc["usa"]

       city  temp  humidity
0  new york    23       180
1   chicago    33        50
2   orlando    13        68

In [16]:
df1 = pd.DataFrame({
    "city":['mumbai','kolkata','delhi','bangalore'],
    "humidity":[80,90,100,78]
})
df1

        city  humidity
0     mumbai        80
1    kolkata        90
2      delhi       100
3  bangalore        78

In [26]:
df2= pd.DataFrame({
    "city":['mumbai','kolkata','bangalore'],
    "temp":[32 ,43 ,21]
})
df2

        city  temp
0     mumbai    32
1    kolkata    43
2  bangalore    21

how concat works?

In [27]:
concated_dataframe = pd.concat([df1,df2],axis = 1)
concated_dataframe

        city  humidity       city  temp
0     mumbai        80     mumbai  32.0
1    kolkata        90    kolkata  43.0
2      delhi       100  bangalore  21.0
3  bangalore        78        NaN   NaN

how marge works?

In [28]:
marged_dataframe = pd.merge(df1,df2,on="city")
marged_dataframe

        city  humidity  temp
0     mumbai        80    32
1    kolkata        90    43
2  bangalore        78    21

In [31]:
marged_dataframe = pd.merge(df1,df2,on="city" ,how ="outer")
marged_dataframe

        city  humidity  temp
0  bangalore        78  21.0
1      delhi       100   NaN
2    kolkata        90  43.0
3     mumbai        80  32.0